package kr.dbp.naemom.utils;

public class Fortune {

	static final String fortune1 ="물을 섞으면 깊어지듯이, 너의 인생도 점점 풍요로워질 것입니다.\r\n"
			+ "한 발짝 더 나아가면 큰 성과를 얻을 수 있을 것입니다.\r\n"
			+ "주위의 사람들이 너를 응원하고 지지하며 성공을 도모할 것입니다.\r\n"
			+ "새로운 기회가 찾아올 것이며, 그 기회를 잘 활용하면 좋은 결과를 얻을 수 있습니다.\r\n"
			+ "앞으로의 시간은 안정적인 기운으로 가득할 것입니다.\r\n"
			+ "너의 노력과 열정이 결실을 맺을 것입니다.";

	static final String fortune2 ="주위의 사람들과 협력하면 큰 성과를 이룰 수 있습니다.\r\n"
			+ "지금까지의 어려움을 이겨내고 더 나은 미래를 향해 나아갈 수 있습니다.\r\n"
			+ "조용히 생각하고 행동하는 것이 큰 성공을 가져올 것입니다.\r\n"
			+ "주위의 사람들과의 원만한 관계를 유지하면 좋은 결과를 얻을 수 있습니다.\r\n"
			+ "긍정적인 마음가짐으로 새로운 도전에 임하면 좋은 결과를 얻을 수 있습니다.\r\n"
			+ "지금까지의 경험을 토대로 성공을 이룰 수 있습니다.";
	static final String fortune3 ="주변의 도움과 조언을 잘 활용하면 원하는 목표를 달성할 수 있습니다.\r\n"
			+ "모든 일에 최선을 다하면 좋은 결과를 얻을 수 있습니다.\r\n"
			+ "앞으로의 시간은 안정과 행운으로 가득할 것입니다.\r\n"
			+ "긍정적인 에너지를 유지하면 더 나은 결과를 얻을 수 있습니다.\r\n"
			+ "성실한 노력이 결실을 맺을 것입니다.\r\n"
			+ "자신의 잠재력을 믿고 도전하면 큰 성공을 얻을 수 있습니다.\r\n"
			+ "불확실한 상황에서도 희망을 잃지 마세요. 좋은 결과가 기다리고 있습니다.";
	static final String fortune4 ="자신의 역량을 인정하고 노력하면 좋은 결과를 얻을 수 있습니다.\r\n"
			+ "주변의 도움을 받아 큰 성과를 이룰 수 있습니다.\r\n"
			+ "기회가 찾아오면 적극적으로 대처하세요. 그것이 성공으로 이끌어줄 것입니다.\r\n"
			+ "자신의 목표를 분명히 하고 그것을 위해 노력하면 좋은 결과를 얻을 수 있습니다.\r\n"
			+ "긍정적인 사고와 노력이 좋은 결과를 가져다 줄 것입니다.\r\n"
			+ "자신의 강점을 발휘하면 큰 성공을 이룰 수 있습니다.";
	static final String fortune5 ="자신의 잠재력을 믿고 도전하면 큰 성과를 얻을 수 있습니다.\r\n"
			+ "자신의 능력을 충분히 발휘하면 좋은 결과를 얻을 수 있습니다.\r\n"
			+ "주변의 도움과 협력을 잘 활용하면 좋은 결과를 이끌어낼 수 있습니다.\r\n"
			+ "자신의 목표에 집중하고 노력하면 성공을 얻을 수 있습니다.\r\n"
			+ "긍정적인 마음가짐으로 어려움을 극복하면 좋은 결과를 얻을 수 있습니다.\r\n"
			+ "주변의 사람들과의 관계를 잘 유지하면 좋은 결과를 이룰 수 있습니다.";
	static final String fortune6 ="자신의 역량을 인정하고 노력하면 큰 성과를 얻을 수 있습니다.\r\n"
			+ "앞으로의 시간은 안정과 행운으로 가득할 것입니다.\r\n"
			+ "자신을 사랑하고 이해하는 것이 큰 성공을 가져다 줄 것입니다.\r\n"
			+ "긍정적인 에너지를 유지하면 좋은 결과를 얻을 수 있습니다.\r\n"
			+ "자신의 장점을 잘 활용하면 큰 성공을 이룰 수 있습니다.\r\n"
			+ "불확실한 상황에서도 희망을 잃지 마세요. 좋은 결과가 기다리고 있습니다.";
	static final String fortune7 ="자신의 목표를 분명히 하고 그것을 위해 노력하면 좋은 결과를 얻을 수 있습니다.\r\n"
			+ "주변의 도움을 받아 큰 성과를 이룰 수 있습니다.\r\n"
			+ "기회가 찾아오면 적극적으로 대처하세요. 그것이 성공으로 이끌어줄 것입니다.\r\n"
			+ "자신의 강점을 발휘하면 큰 성공을 이룰 수 있습니다.\r\n"
			+ "끈기와 인내심을 가지고 어려움을 극복하면 좋은 결과를 얻을 수 있습니다.\r\n"
			+ "자신의 잠재력을 믿고 도전하면 큰 성과를 얻을 수 있습니다.";
	static final String fortune8 ="자신의 능력을 충분히 발휘하면 좋은 결과를 얻을 수 있습니다.\r\n"
			+ "주변의 도움과 협력을 잘 활용하면 좋은 결과를 이끌어낼 수 있습니다.\r\n"
			+ "자신의 목표에 집중하고 노력하면 성공을 얻을 수 있습니다.\r\n"
			+ "긍정적인 마음가짐으로 어려움을 극복하면 좋은 결과를 얻을 수 있습니다.";
	static final String fortune9 ="자신의 역량을 인정하고 노력하면 큰 성과를 얻을 수 있습니다. 앞으로의 시간은 안정과 행운으로 가득할 것입니다. 자신을 사랑하고 이해하는 것이 큰 성공을 가져다 줄 것입니다. 긍정적인 에너지를 유지하면 좋은 결과를 얻을 수 있습니다. 자신의 장점을 잘 활용하면 큰 성공을 이룰 수 있습니다. 불확실한 상황에서도 희망을 잃지 마세요. 좋은 결과가 기다리고 있습니다. 자신의 목표를 분명히 하고 그것을 위해 노력하면 좋은 결과를 얻을 수 있습니다.";
	static final String fortune10 ="주변의 도움을 받아 큰 성과를 이룰 수 있습니다. 기회가 찾아오면 적극적으로 대처하세요. 그것이 성공으로 이끌어줄 것입니다. 자신의 강점을 발휘하면 큰 성공을 이룰 수 있습니다. 끈기와 인내심을 가지고 어려움을 극복하면 좋은 결과를 얻을 수 있습니다. 자신의 잠재력을 믿고 도전하면 큰 성과를 얻을 수 있습니다. 자신의 능력을 충분히 발휘하면 좋은 결과를 얻을 수 있습니다. ";
	
	public static String fortune() {
		String[] fortunes = {fortune1, fortune2, fortune3, fortune4, fortune5,fortune6, fortune7, fortune8, fortune9, fortune10};
	    int random = (int)(Math.random() * fortunes.length);

	    return fortunes[random];
	}
}



